In [2]:
import pandas as pd

In [3]:
df = pd.read_csv(r"C:\Users\singh\OneDrive\Desktop\Python\Data\placement.csv")
df

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [7]:
df.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [60]:
df.tail()

    cgpa  resume_score  placed
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

In [73]:
df.sample()

    cgpa  resume_score  placed
67  6.59          6.81       1

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cgpa          100 non-null    float64
 1   resume_score  100 non-null    float64
 2   placed        100 non-null    int64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [75]:
df.describe()

           cgpa  resume_score      placed
count  100.0000    100.000000  100.000000
mean     6.9422      6.930500    0.500000
std      1.1192      0.979608    0.502519
min      5.2700      4.950000    0.000000
25%      5.9800      6.190000    0.000000
50%      6.6200      7.055000    0.500000
75%      8.0450      7.640000    1.000000
max      9.4000      9.060000    1.000000

In [8]:
top_left = df.iloc[:4,:3]
top_left

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1

In [83]:
cgpa_placed = df.loc[:,["cgpa","placed"]]
cgpa_placed

    cgpa  placed
0   8.14       1
1   6.17       0
2   8.27       1
3   6.88       1
4   7.52       1
..   ...     ...
95  6.33       0
96  8.23       1
97  6.65       0
98  8.14       1
99  6.09       0

[100 rows x 2 columns]

In [ ]:
s = df.axes            # df.shape
s
df.shape

(100, 3)

In [4]:
p = df.dtypes
p

cgpa            float64
resume_score    float64
placed            int64
dtype: object

In [5]:
b = df.empty          #return true ==> have any missing valuse
b

False

In [6]:
df.isnull().sum()

cgpa            0
resume_score    0
placed          0
dtype: int64

In [99]:
df = df.dropna()  # for remove missing rows

In [ ]:
df.ndim    #No of axis

2

In [ ]:
df.shape
df.shape[0]         #total rows
df.shape[1]         #total columns

3

In [100]:
df.size # row count * column count

300

In [101]:
df.values       # get a numpy array for df

array([[8.14, 6.52, 1.  ],
       [6.17, 5.17, 0.  ],
       [8.27, 8.86, 1.  ],
       [6.88, 7.27, 1.  ],
       [7.52, 7.3 , 1.  ],
       [8.77, 6.19, 1.  ],
       [5.34, 7.09, 0.  ],
       [6.56, 6.29, 0.  ],
       [6.32, 6.71, 0.  ],
       [7.69, 7.12, 1.  ],
       [6.18, 6.35, 0.  ],
       [5.44, 6.54, 0.  ],
       [6.09, 7.01, 0.  ],
       [8.5 , 5.09, 1.  ],
       [7.51, 6.25, 1.  ],
       [8.88, 5.93, 1.  ],
       [8.04, 7.64, 1.  ],
       [7.81, 8.71, 1.  ],
       [5.94, 5.88, 0.  ],
       [6.75, 8.11, 1.  ],
       [5.8 , 8.06, 0.  ],
       [6.53, 7.64, 0.  ],
       [6.16, 5.77, 0.  ],
       [6.05, 7.13, 0.  ],
       [8.22, 6.18, 1.  ],
       [7.76, 5.68, 1.  ],
       [6.27, 6.47, 0.  ],
       [5.51, 6.15, 0.  ],
       [7.46, 7.67, 1.  ],
       [6.19, 7.3 , 0.  ],
       [7.36, 7.15, 1.  ],
       [5.92, 7.02, 0.  ],
       [5.87, 7.96, 0.  ],
       [8.43, 7.73, 1.  ],
       [8.87, 7.19, 1.  ],
       [8.07, 7.48, 1.  ],
       [8.16, 7.56, 1.  ],
       [9.05, 8.21, 1.  ],
       [6.  , 8.72, 0.  ],
       [7.5 , 6.19, 1.  ],
       [8.25, 5.32, 1.  ],
       [8.68, 5.15, 1.  ],
       [6.9 , 6.91, 1.  ],
       [8.21, 7.95, 1.  ],
       [5.47, 5.92, 0.  ],
       [8.1 , 5.44, 1.  ],
       [5.83, 5.21, 0.  ],
       [7.05, 8.14, 1.  ],
       [5.54, 6.57, 0.  ],
       [5.46, 6.73, 0.  ],
       [8.22, 6.74, 1.  ],
       [6.54, 7.39, 0.  ],
       [5.9 , 7.5 , 0.  ],
       [6.  , 7.16, 0.  ],
       [5.92, 7.18, 0.  ],
       [6.94, 6.87, 1.  ],
       [6.13, 6.43, 0.  ],
       [6.34, 7.21, 0.  ],
       [6.47, 7.37, 0.  ],
       [5.95, 7.57, 0.  ],
       [5.87, 6.64, 0.  ],
       [6.89, 7.96, 1.  ],
       [5.75, 8.43, 0.  ],
       [8.65, 7.58, 1.  ],
       [7.93, 8.09, 1.  ],
       [6.04, 8.75, 0.  ],
       [8.35, 8.02, 1.  ],
       [6.59, 6.81, 1.  ],
       [6.01, 7.49, 0.  ],
       [8.06, 9.06, 1.  ],
       [7.12, 7.41, 1.  ],
       [7.34, 8.22, 1.  ],
       [7.63, 7.98, 1.  ],
       [5.76, 6.48, 0.  ],
       [5.54, 7.36, 0.  ],
       [6.34, 7.94, 1.  ],
       [9.4 , 5.5 , 1.  ],
       [5.88, 6.92, 0.  ],
       [5.79, 5.66, 0.  ],
       [5.27, 7.28, 0.  ],
       [7.83, 7.7 , 1.  ],
       [6.12, 6.72, 0.  ],
       [7.92, 6.06, 1.  ],
       [7.6 , 8.08, 1.  ],
       [5.76, 6.49, 0.  ],
       [6.72, 5.46, 0.  ],
       [6.18, 5.76, 0.  ],
       [5.62, 5.05, 0.  ],
       [8.07, 6.07, 1.  ],
       [5.99, 7.49, 0.  ],
       [5.85, 5.56, 0.  ],
       [8.28, 6.3 , 1.  ],
       [5.43, 6.18, 0.  ],
       [9.31, 7.39, 1.  ],
       [8.01, 4.95, 1.  ],
       [6.33, 6.38, 0.  ],
       [8.23, 7.76, 1.  ],
       [6.65, 7.78, 0.  ],
       [8.14, 5.63, 1.  ],
       [6.09, 6.61, 0.  ]])

In [102]:
df = df.copy()

In [104]:
p = df.sort_values(by = 'resume_score')
p

    cgpa  resume_score  placed
94  8.01          4.95       1
87  5.62          5.05       0
13  8.50          5.09       1
41  8.68          5.15       1
1   6.17          5.17       0
..   ...           ...     ...
17  7.81          8.71       1
38  6.00          8.72       0
65  6.04          8.75       0
2   8.27          8.86       1
69  8.06          9.06       1

[100 rows x 3 columns]

In [108]:
p = df.sort_values(by = 'resume_score',ascending=False)
p

    cgpa  resume_score  placed
69  8.06          9.06       1
2   8.27          8.86       1
65  6.04          8.75       0
38  6.00          8.72       0
17  7.81          8.71       1
..   ...           ...     ...
1   6.17          5.17       0
41  8.68          5.15       1
13  8.50          5.09       1
87  5.62          5.05       0
94  8.01          4.95       1

[100 rows x 3 columns]

In [9]:
df['cgpa'] = df['cgpa'].astype(str)
df

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [10]:
df.dtypes

cgpa             object
resume_score    float64
placed            int64
dtype: object

In [112]:
df['resume_score'] = df['resume_score'].astype(int)

In [113]:
df.dtypes

cgpa            object
resume_score     int64
placed           int64
dtype: object

In [ ]:
df['resume_score'] = df['resume_score'].add(4)

In [12]:
df['resume_score'] = df['resume_score'].sub(4)

In [13]:
df

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [14]:
df['cgpa'] = df['cgpa'].astype(float)

In [15]:
df.count()

cgpa            100
resume_score    100
placed          100
dtype: int64

In [16]:
df.max()

cgpa            9.40
resume_score    9.06
placed          1.00
dtype: float64

In [121]:
df.min()

cgpa            5.27
resume_score    4.00
placed          0.00
dtype: float64

In [123]:
g = df.filter(items=['cgpa','placed'])
g

    cgpa  placed
0   8.14       1
1   6.17       0
2   8.27       1
3   6.88       1
4   7.52       1
..   ...     ...
95  6.33       0
96  8.23       1
97  6.65       0
98  8.14       1
99  6.09       0

[100 rows x 2 columns]

In [125]:
df[['cgpa','placed']]

    cgpa  placed
0   8.14       1
1   6.17       0
2   8.27       1
3   6.88       1
4   7.52       1
..   ...     ...
95  6.33       0
96  8.23       1
97  6.65       0
98  8.14       1
99  6.09       0

[100 rows x 2 columns]

In [126]:
s = df.filter(items = [5,6],axis=0) # axis = 0 means rowwiseoperation
s

   cgpa  resume_score  placed
5  8.77             6       1
6  5.34             7       0

In [127]:
t = df.filter(like = '5',axis = 0)
t

    cgpa  resume_score  placed
5   8.77             6       1
15  8.88             5       1
25  7.76             5       1
35  8.07             7       1
45  8.10             5       1
50  8.22             6       1
51  6.54             7       0
52  5.90             7       0
53  6.00             7       0
54  5.92             7       0
55  6.94             6       1
56  6.13             6       0
57  6.34             7       0
58  6.47             7       0
59  5.95             7       0
65  6.04             8       0
75  6.34             7       1
85  6.72             5       0
95  6.33             6       0

In [17]:
p = df.rename(columns={'cgpa':'updated_cgpa',
                       'resume_score': 'semester_marks'})

In [18]:
df['half'] = df['cgpa'].where(df['cgpa']>7,other = 0)
df.head(10)

   cgpa  resume_score  placed  half
0  8.14          6.52       1  8.14
1  6.17          5.17       0  0.00
2  8.27          8.86       1  8.27
3  6.88          7.27       1  0.00
4  7.52          7.30       1  7.52
5  8.77          6.19       1  8.77
6  5.34          7.09       0  0.00
7  6.56          6.29       0  0.00
8  6.32          6.71       0  0.00
9  7.69          7.12       1  7.69

In [7]:
df.groupby('placed').size()                         # it returns number of rows

placed
0    50
1    50
dtype: int64